docs/glint/thebook.txt

1.13.1 Writing A Module Vs A Program
------------------------------------

  A Glint program is a collection of Glint source code that may be
  compiled and linked to an executable. A Glint program may import Glint
  modules.

  A Glint module is a collection of Glint source code that does not
  compile to executable, but rather a library. This library then may be
  used by a linker to include it's code in a separate executable. This
  library is also used by the Glint compiler to resolve the Glint
  module's metadata that produced it when compiling code that imports
  the module.

  Programs and modules may import modules, but neither programs nor
  modules may import programs.


1.13.2 Exporting Variables
--------------------------


1.13.3 Importing Modules
------------------------
